In [1]:
import pandas as pd

#查看pandas的版本
pd.__version__

'0.23.4'

In [8]:
'''
資料類型 - Series
Series，是一個類似陣列的物件，裡面可包含陣列的資料
'''

my_obj = pd.Series([4, 7, -5, 3])

#若要讀取Series的value我們可以使用.values
my_obj.values

#若要讀取Series的index
my_obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
'''
改變Index
Index可以不一定是要從0開始也可以是其他的內容，我們可以這樣宣告：
'''

my_obj2 = pd.Series([8,9,10,11], index=['a','b','c','d'])

#若要讀取Series的value我們可以使用.values
my_obj2.values

#若要讀取Series的index
my_obj2.index

#取出8這個幸運數字
my_obj2['a']

#想知道a index在不在my_obj2
'a' in my_obj2

True

In [6]:
#最基本的一個Series格式，其實之前提到的dictionary也可以變成Series

dic_data = {'name':'apple','birthday':'1996-1-1','luckynumber':7 }

my_obj3 = pd.Series(dic_data)

my_obj3

name              apple
birthday       1996-1-1
luckynumber           7
dtype: object

In [5]:
#看看它內部的資料型態吧！宣告一組布林的陣列再把它變成Series

registration = [True,False,True,True]
registration = pd.Series(registration)
registration

0     True
1    False
2     True
3     True
dtype: bool

In [7]:
dictionary = {'A':'an animal',
              'B':'a color',
              'C':'a fruit'}
dictionary = pd.Series(dictionary)
dictionary

A    an animal
B      a color
C      a fruit
dtype: object

In [15]:
#DataFrame就像是我們在使用的excel表格一樣，是一個二維的數據有index和column

data = {'name': ['Bob', 'Nancy','Amy','Elsa','Jack'],
        'year': [1996, 1997, 1997, 1996, 1997],
        'month': [8, 8, 7, 1, 12],
        'day':[11,23,8,3,11]}
myframe = pd.DataFrame(data)
myframe

#我要讓day在month後面怎麼辦呢？
myframe2 = pd.DataFrame(data,columns=['name','year', 'day', 'month'])
myframe2

#定義新的frame，並在最後column下多加一個column，就會看到NaN，因為我們並沒有給它資料。
myframe3 = pd.DataFrame(data,columns=['name','year', 'month', 'day','luckynumber'])
myframe3

#現在我們來給它資料吧！先定一一組幸運數字的資料
luckynumber = ['3','2','1','7','8']
luckynumber = pd.Series(luckynumber)

#接著把資料放到myframe3的luckynumber內
myframe3['luckynumber'] = luckynumber
myframe3

    name  year  month  day luckynumber
0    Bob  1996      8   11           3
1  Nancy  1997      8   23           2
2    Amy  1997      7    8           1
3   Elsa  1996      1    3           7
4   Jack  1997     12   11           8

In [2]:
df = pd.read_csv('C:/Users/02445/AssetsImportCompleteSample.csv')

#.head()可以顯示5筆資料（預設是5筆）也可以自訂，只需要在括弧內加上要的數字
df.head()
df.head(3)

#要顯示最後五筆資料則可以使用.tail()，和head()一樣
df.tail()

,ANCESTOR,ASSETNUM,ASSETTAG,ASSETTYPE,AUTOWOGEN,BINNUM,BUDGETCOST,CALNUM,CHANGEBY,CHANGEDATE,CHANGEPMSTATUS,CHILDREN,CONDITIONCODE,AS_DESCRIPTION
7,8,Note038,121,IT11,0,63,0,95,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,97,Thinkpad notebook T61P
8,9,Note039,132,IT12,0,64,0,96,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,98,Thinkpad notebook T61P
9,10,Note040,143,IT13,0,65,0,97,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,99,Thinkpad notebook T61P
10,11,Note041,154,IT14,0,66,0,98,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,100,Thinkpad notebook T61P
11,12,Note042,165,IT15,0,67,0,99,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,101,Thinkpad notebook T61P

In [39]:
#用.info()可以看到該檔案的資訊
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Columns: 187 entries, ANCESTOR to TABLEVALUE
dtypes: float64(141), int64(25), object(21)
memory usage: 17.6+ KB

In [40]:
'''
要如何知道檔案的大小呢？使用shape就會顯示(rows,columns)
'''
df.shape

(12, 187)

In [41]:
#選擇一項資料

df['ASSETNUM'][0:3]

0    Note031
1    Note032
2    Note033
Name: ASSETNUM, dtype: object

In [47]:
#選擇多項資料只需要把要選擇的資料用list的資料格式就可以了

df[['ANCESTOR','ASSETNUM']][0:3]

   ANCESTOR ASSETNUM
0         1  Note031
1         2  Note032
2         3  Note033

In [3]:
#資料新增

df.insert(3,column="sport",value="Basketball")
df.head()

,ANCESTOR,ASSETNUM,ASSETTAG,sport,ASSETTYPE,AUTOWOGEN,BINNUM,BUDGETCOST,CALNUM,CHANGEBY,CHANGEDATE,CHANGEPMSTATUS,CHILDREN,CONDITIONCODE,AS_DESCRIPTION
0,1,Note031,44,Basketball,IT4,0,56,0,88,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,90,Thinkpad notebook T61P
1,2,Note032,55,Basketball,IT5,0,57,0,89,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,NaN,91,Thinkpad notebook T61P
2,3,Note033,66,Basketball,IT6,0,58,0,90,MAXADMIN,2011-09-22T17:11:45-07:00,NaN,0.0,92,Thinkpad notebook T61P
3,4,Note034,77,Basketball,IT7,0,59,0,91,MAXADMIN,2011-09-22T17:11:45-07:00,NaN,0.0,93,Thinkpad notebook T61P
4,5,Note035,88,Basketball,IT8,0,60,0,92,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,94,Thinkpad notebook T61P

In [8]:
#資料刪除

df.dropna()

#記得把它存到一個變數，不然它是不會改變的哦
df = df.dropna()

df.head()

,ANCESTOR,ASSETNUM,ASSETTAG,sport,ASSETTYPE,AUTOWOGEN,BINNUM,BUDGETCOST,CALNUM,CHANGEBY,CHANGEDATE,CHANGEPMSTATUS,CHILDREN,CONDITIONCODE,AS_DESCRIPTION
0,1,Note031,44,Basketball,IT4,0,56,0,88,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,90,Thinkpad notebook T61P
4,5,Note035,88,Basketball,IT8,0,60,0,92,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,94,Thinkpad notebook T61P
5,6,Note036,99,Basketball,IT9,0,61,0,93,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,95,Thinkpad notebook T61P
6,7,Note037,110,Basketball,IT10,0,62,0,94,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,96,Thinkpad notebook T61P
7,8,Note038,121,Basketball,IT11,0,63,0,95,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,97,Thinkpad notebook T61P

In [3]:
#空白資料填充

df = df.fillna(0)
df.head()

,ANCESTOR,ASSETNUM,ASSETTAG,ASSETTYPE,AUTOWOGEN,BINNUM,BUDGETCOST,CALNUM,CHANGEBY,CHANGEDATE,CHANGEPMSTATUS,CHILDREN,CONDITIONCODE,AS_DESCRIPTION
0,1,Note031,44,IT4,0,56,0,88,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,90,Thinkpad notebook T61P
1,2,Note032,55,IT5,0,57,0,89,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,91,Thinkpad notebook T61P
2,3,Note033,66,IT6,0,58,0,90,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,92,Thinkpad notebook T61P
3,4,Note034,77,IT7,0,59,0,91,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,93,Thinkpad notebook T61P
4,5,Note035,88,IT8,0,60,0,92,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,94,Thinkpad notebook T61P

In [5]:
#資料排序

df.sort_values("ASSETTAG").head()

#排序顛倒
df.sort_values("ASSETTAG",ascending= False).head()

,ANCESTOR,ASSETNUM,ASSETTAG,ASSETTYPE,AUTOWOGEN,BINNUM,BUDGETCOST,CALNUM,CHANGEBY,CHANGEDATE,CHANGEPMSTATUS,CHILDREN,CONDITIONCODE,AS_DESCRIPTION
11,12,Note042,165,IT15,0,67,0,99,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,101,Thinkpad notebook T61P
10,11,Note041,154,IT14,0,66,0,98,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,100,Thinkpad notebook T61P
9,10,Note040,143,IT13,0,65,0,97,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,99,Thinkpad notebook T61P
8,9,Note039,132,IT12,0,64,0,96,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,98,Thinkpad notebook T61P
7,8,Note038,121,IT11,0,63,0,95,MAXADMIN,2011-09-22T17:11:45-07:00,0.0,0.0,97,Thinkpad notebook T61P